In [11]:
import pandas as pd
import numpy as np
import seaborn as sns

In [12]:
df = sns.load_dataset('iris')

In [13]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [14]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [15]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

## assign

Assign new columns to a DataFrame.<br>
Returns a new object with all original columns in addition to new ones. Existing columns that are re-assigned will be overwritten

assign always returns a **copy** of the data, leaving the original DataFrame untouched.

In [17]:
df.assign(sepal_ratio=(df['sepal_width']/df['sepal_length'])).head()

   sepal_length  sepal_width  petal_length  petal_width species  sepal_ratio
0           5.1          3.5           1.4          0.2  setosa     0.686275
1           4.9          3.0           1.4          0.2  setosa     0.612245
2           4.7          3.2           1.3          0.2  setosa     0.680851
3           4.6          3.1           1.5          0.2  setosa     0.673913
4           5.0          3.6           1.4          0.2  setosa     0.720000

In the example above, we inserted a precomputed value. We can also pass in a function of one argument to be evaluated on the DataFrame being assigned to.

In [18]:
df.assign(sepal_ratio= lambda x: x['sepal_width']/x['sepal_length'])

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_ratio
0,5.1,3.5,1.4,0.2,setosa,0.686275
1,4.9,3.0,1.4,0.2,setosa,0.612245
2,4.7,3.2,1.3,0.2,setosa,0.680851
3,4.6,3.1,1.5,0.2,setosa,0.673913
4,5.0,3.6,1.4,0.2,setosa,0.720000
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0.447761
146,6.3,2.5,5.0,1.9,virginica,0.396825
147,6.5,3.0,5.2,2.0,virginica,0.461538
148,6.2,3.4,5.4,2.3,virginica,0.548387
149,5.9,3.0,5.1,1.8,virginica,0.508475

In [19]:
%timeit df.assign(sepal_ratio=(df['sepal_width']/df['sepal_length']))

166 µs ± 17.4 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [20]:
%timeit df.assign(sepal_ratio= lambda x: x['sepal_width']/x['sepal_length'])

161 µs ± 16.1 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

as you can see using function here is faster

## query

In [21]:
df.query('sepal_length > 6') # similar to --> df[df['sepal_length']>6]

     sepal_length  sepal_width  petal_length  petal_width     species
50            7.0          3.2           4.7          1.4  versicolor
51            6.4          3.2           4.5          1.5  versicolor
52            6.9          3.1           4.9          1.5  versicolor
54            6.5          2.8           4.6          1.5  versicolor
56            6.3          3.3           4.7          1.6  versicolor
..            ...          ...           ...          ...         ...
144           6.7          3.3           5.7          2.5   virginica
145           6.7          3.0           5.2          2.3   virginica
146           6.3          2.5           5.0          1.9   virginica
147           6.5          3.0           5.2          2.0   virginica
148           6.2          3.4           5.4          2.3   virginica

[61 rows x 5 columns]

In [22]:
df.query('sepal_length > 6 & sepal_width > 3.5')

     sepal_length  sepal_width  petal_length  petal_width    species
109           7.2          3.6           6.1          2.5  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

In [23]:
%matplotlib inline
df.query('sepal_length > 6 & sepal_width > 3.5').assign(
    sepal_ratio = lambda x: x['sepal_width'] / x['sepal_length'],
    petal_ratio = lambda x: x['petal_width'] / x['petal_length'],
)

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_ratio,petal_ratio
109,7.2,3.6,6.1,2.5,virginica,0.500000,0.409836
117,7.7,3.8,6.7,2.2,virginica,0.493506,0.328358
131,7.9,3.8,6.4,2.0,virginica,0.481013,0.312500

**you can use `and` instead of `&`**

## Indexing / selection

In [24]:
new_df = pd.DataFrame(
    {
        'name': ['Emma', 'Harry', 'Taylor', 'Alison'],
        'age': [20, 20, 28, 30],
        'status': ["in-rell", "in-rell", np.NaN, 'single'],
        'addreess': ['US', 'US', 'CA', 'CA'],
    },
)
new_df = new_df.set_index('name')
new_df

        age   status addreess
name
Emma     20  in-rell       US
Harry    20  in-rell       US
Taylor   28      NaN       CA
Alison   30   single       CA

In [25]:
new_df.iloc[1:3]

        age   status addreess
name
Harry    20  in-rell       US
Taylor   28      NaN       CA

In [26]:
new_df.loc['Emma': 'Taylor']

        age   status addreess
name
Emma     20  in-rell       US
Harry    20  in-rell       US
Taylor   28      NaN       CA

In [27]:
new_df['age']

name
Emma      20
Harry     20
Taylor    28
Alison    30
Name: age, dtype: int64

In [28]:
new_df.loc['Emma']

age              20
status      in-rell
addreess         US
Name: Emma, dtype: object

In [29]:
new_df.loc[:, 'age']

name
Emma      20
Harry     20
Taylor    28
Alison    30
Name: age, dtype: int64

## Data alignment and arithmetic

Data alignment between DataFrame objects automatically align on **<ins>both</ins> the columns and the index (row labels)**. Again, the resulting object will have the union of the column and row labels.

In [30]:
df1 = pd.DataFrame(np.random.randint(0, 10, size= (5, 4)), columns=['a', 'b', 'c', 'd'])
df1

   a  b  c  d
0  5  7  9  0
1  7  8  8  0
2  3  5  4  1
3  2  2  6  4
4  9  9  4  0

In [31]:
df2 = pd.DataFrame(np.random.randint(0, 10, size=(4, 3)), columns=['a', 'b', 'c'])
df2

   a  b  c
0  4  7  2
1  9  3  6
2  0  0  5
3  8  2  0

In [32]:
df1 + df2

      a     b     c   d
0   9.0  14.0  11.0 NaN
1  16.0  11.0  14.0 NaN
2   3.0   5.0   9.0 NaN
3  10.0   4.0   6.0 NaN
4   NaN   NaN   NaN NaN

In [33]:
df2.iloc[0, :] - 7 # first row - 7

a   -3
b    0
c   -5
Name: 0, dtype: int64

In [34]:
1 / df1

          a         b         c     d
0  0.200000  0.142857  0.111111   inf
1  0.142857  0.125000  0.125000   inf
2  0.333333  0.200000  0.250000  1.00
3  0.500000  0.500000  0.166667  0.25
4  0.111111  0.111111  0.250000   inf

___

In [35]:
df1 = pd.DataFrame(np.random.randint(0, 10, size= (3, 3)), columns=['a', 'b', 'c'], dtype=bool)
df1

      a     b     c
0  True  True  True
1  True  True  True
2  True  True  True

In [36]:
df2 = pd.DataFrame(np.random.randint(0, 10, size=(4, 4)), columns=['a', 'b', 'c', 'd'], dtype=bool)
df2

      a     b      c      d
0  True  True   True  False
1  True  True   True   True
2  True  True   True   True
3  True  True  False   True

In [37]:
df1 & df2

       a      b      c   d
0   True   True   True NaN
1   True   True   True NaN
2   True   True   True NaN
3  False  False  False NaN

In [38]:
df1 | df2

       a      b      c   d
0   True   True   True NaN
1   True   True   True NaN
2   True   True   True NaN
3  False  False  False NaN

In [39]:
-df1

       a      b      c
0  False  False  False
1  False  False  False
2  False  False  False

## Transposing

In [40]:
df1

      a     b     c
0  True  True  True
1  True  True  True
2  True  True  True

In [41]:
df1.T

      0     1     2
a  True  True  True
b  True  True  True
c  True  True  True

## DataFrame interoperability with NumPy functions

In [42]:
df1 = pd.DataFrame(np.random.randint(0, 10, size= (3, 3)), columns=['a', 'b', 'c'])
df1

   a  b  c
0  4  3  3
1  4  2  8
2  1  3  5

In [43]:
np.exp(df1)

           a          b            c
0  54.598150  20.085537    20.085537
1  54.598150   7.389056  2980.957987
2   2.718282  20.085537   148.413159

In [44]:
np.sum(df1)

/opt/miniconda3/envs/nlp2/lib/python3.12/site-packages/numpy/core/fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)

a     9
b     8
c    16
dtype: int64

In [45]:
np.asarray(df1)

array([[4, 3, 3],
       [4, 2, 8],
       [1, 3, 5]])

In [46]:
df1.to_numpy()

array([[4, 3, 3],
       [4, 2, 8],
       [1, 3, 5]])

## Console display

In [47]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [49]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

___
<br>

You can adjust the max width of the individual columns by setting display.max_colwidth

In [50]:
pd.set_option("display.max_colwidth", 30)

You can also set this settings with:

In [51]:
pd.options.display.max_colwidth = 30

Similar settings also exist for:

- pd.options.display.max_rows
- pd.options.display.max_columns
- pd.options.display.precision

The precision option sets the number of decimals to be displayed in a dataframe.

In [52]:
df1 = pd.DataFrame(np.random.randn(3, 4))
df1

          0         1         2         3
0  0.517201  0.027481 -1.111204 -0.711696
1 -0.167782  1.468174  0.620680 -0.572095
2 -0.442238 -1.002295 -2.352208  0.573619

In [53]:
pd.options.display.precision = 2

In [54]:
df1

      0     1     2     3
0  0.52  0.03 -1.11 -0.71
1 -0.17  1.47  0.62 -0.57
2 -0.44 -1.00 -2.35  0.57

### Example for query

In [55]:
df = pd.DataFrame(
    {
    'A': range(1, 6),
    'B': range(10, 0, -2),
    'C': range(10, 5, -1)
    }
)
df

   A   B   C
0  1  10  10
1  2   8   9
2  3   6   8
3  4   4   7
4  5   2   6

In [56]:
df.query('A > B')

   A  B  C
4  5  2  6

In [57]:
mask = df['A'] > df['B']
df[mask]

   A  B  C
4  5  2  6